tap "dapr/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "microsoft/git"
tap "mymac/local"
tap "romkatv/powerlevel10k"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Stores Git credentials for Visual Studio Team Services
brew "git-credential-manager"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# OpenID Certified OAuth 2.0 Server and OpenID Connect Provider
brew "ory-hydra"
# Implementation of Telnet and SSH
brew "putty"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# SSTP (Microsofts Remote Access Solution for PPP over SSL) client
brew "mymac/local/sstp-client@1.0.13"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Application launcher and productivity software
cask "alfred"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Securely store, manage and exchange many blockchain assets
cask "coinomi-wallet"
# Developer platform
cask "dotnet-sdk"
cask "git-credential-manager-core"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Kubernetes IDE
cask "lens"
# Open-source, KeePass-client and password manager
cask "macpass"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Cloud storage client
cask "onedrive"
# Collaboration platform for API development
cask "postman"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Video communication and virtual meeting platform
cask "zoom"
